; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v1 ?v12)
             (pred_4 ?v11 ?v3)
             (pred_10 ?v1 ?v3)
             (pred_12 ?v7 ?v1 )
	     (pred_9 ?v1)
             (pred_6 ?v8)
             (pred_3 ?v11)
             (pred_5 ?v3)
             (pred_7 ?v1)
             (pred_2 ?v11)
             (pred_1 ?v1)
             (pred_8 ))



(:action op_3
:parameters (?v2 ?v10 ?v9 ?v6)
:precondition (and (pred_6 ?v2) (pred_6 ?v10) (pred_3 ?v9) (pred_5 ?v6)
          (pred_11 ?v2 ?v10) (pred_4 ?v9 ?v6)
                   (pred_10 ?v10 ?v6) (pred_9 ?v2) 
                   (pred_7 ?v10) (pred_2 ?v9))
:effect (and  (pred_1 ?v10) (not (pred_7 ?v10))))


(:action op_2
:parameters (?v2 ?v4)
:precondition (and (pred_6 ?v2) (pred_6 ?v4)
               (pred_9 ?v2) (pred_11 ?v2 ?v4) (pred_1 ?v4))
:effect (and (pred_9 ?v4) (not (pred_9 ?v2))))

(:action op_5
:parameters (?v2 ?v9)
:precondition (and (pred_6 ?v2) (pred_3 ?v9) 
                  (pred_9 ?v2) (pred_12 ?v9 ?v2) (pred_8 ))
:effect (and (pred_2 ?v9)
   (not (pred_12 ?v9 ?v2)) (not (pred_8 ))))


(:action op_4
:parameters (?v2 ?v13 ?v5)
:precondition (and (pred_6 ?v2) (pred_3 ?v13) (pred_3 ?v5)
                  (pred_9 ?v2) (pred_2 ?v5) (pred_12 ?v13 ?v2))
:effect (and (pred_2 ?v13) (pred_12 ?v5 ?v2)
        (not (pred_2 ?v5)) (not (pred_12 ?v13 ?v2))))

(:action op_1
:parameters (?v2 ?v9)
:precondition (and (pred_6 ?v2) (pred_3 ?v9) 
                  (pred_9 ?v2) (pred_2 ?v9))
:effect (and (pred_8 ) (pred_12 ?v9 ?v2) (not (pred_2 ?v9)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_19 obj_20 obj_08 obj_03 obj_06 obj_17 obj_11 obj_04 obj_09 obj_10 obj_07 obj_16 obj_18 obj_12 obj_02 obj_01
    obj_15 obj_13
    obj_05 obj_14
    )

    (:init
       (pred_8)

       (pred_6 obj_19)
       (pred_6 obj_20)
       (pred_6 obj_08)
       (pred_6 obj_03)
       (pred_6 obj_06)
       (pred_6 obj_17)
       (pred_6 obj_11)
       (pred_6 obj_04)
       (pred_6 obj_09)
       (pred_6 obj_10)
       (pred_6 obj_07)
       (pred_6 obj_16)
       (pred_6 obj_18)
       (pred_6 obj_12)
       (pred_6 obj_02)
       (pred_6 obj_01)
       (pred_5 obj_15)
       (pred_5 obj_13)
       (pred_3 obj_05)
       (pred_3 obj_14)

       (pred_11 obj_19 obj_06)
       (pred_11 obj_19 obj_20)
       (pred_11 obj_20 obj_17)
       (pred_11 obj_20 obj_08)
       (pred_11 obj_20 obj_19)
       (pred_11 obj_08 obj_11)
       (pred_11 obj_08 obj_03)
       (pred_11 obj_08 obj_20)
       (pred_11 obj_03 obj_04)
       (pred_11 obj_03 obj_08)
       (pred_11 obj_06 obj_09)
       (pred_11 obj_06 obj_17)
       (pred_11 obj_06 obj_19)
       (pred_11 obj_17 obj_10)
       (pred_11 obj_17 obj_11)
       (pred_11 obj_17 obj_20)
       (pred_11 obj_17 obj_06)
       (pred_11 obj_11 obj_07)
       (pred_11 obj_11 obj_04)
       (pred_11 obj_11 obj_08)
       (pred_11 obj_11 obj_17)
       (pred_11 obj_04 obj_16)
       (pred_11 obj_04 obj_03)
       (pred_11 obj_04 obj_11)
       (pred_11 obj_09 obj_18)
       (pred_11 obj_09 obj_10)
       (pred_11 obj_09 obj_06)
       (pred_11 obj_10 obj_12)
       (pred_11 obj_10 obj_07)
       (pred_11 obj_10 obj_17)
       (pred_11 obj_10 obj_09)
       (pred_11 obj_07 obj_02)
       (pred_11 obj_07 obj_16)
       (pred_11 obj_07 obj_11)
       (pred_11 obj_07 obj_10)
       (pred_11 obj_16 obj_01)
       (pred_11 obj_16 obj_04)
       (pred_11 obj_16 obj_07)
       (pred_11 obj_18 obj_12)
       (pred_11 obj_18 obj_09)
       (pred_11 obj_12 obj_02)
       (pred_11 obj_12 obj_10)
       (pred_11 obj_12 obj_18)
       (pred_11 obj_02 obj_01)
       (pred_11 obj_02 obj_07)
       (pred_11 obj_02 obj_12)
       (pred_11 obj_01 obj_16)
       (pred_11 obj_01 obj_02)
       (pred_7 obj_17)
       (pred_7 obj_09)
       (pred_10  obj_17 obj_15)
       (pred_10  obj_09 obj_13)
       (pred_1 obj_19)
       (pred_1 obj_20)
       (pred_1 obj_08)
       (pred_1 obj_03)
       (pred_1 obj_06)
       (pred_1 obj_11)
       (pred_1 obj_04)
       (pred_1 obj_10)
       (pred_1 obj_07)
       (pred_1 obj_16)
       (pred_1 obj_18)
       (pred_1 obj_12)
       (pred_1 obj_02)
       (pred_1 obj_01)

       (pred_4  obj_05 obj_15)
       (pred_4  obj_14 obj_13)
       (pred_12 obj_05 obj_02)
       (pred_12 obj_14 obj_16)
       (pred_9 obj_02)
    )

    (:goal (and
       (pred_12 obj_14 obj_08)
    ))
(:constraints
  (always (not (pred_9 obj_07)))
)
)

; plan
1. (op_2 obj_02 obj_01)
   deleted: (pred_9 obj_02)
   added: (pred_9 obj_01)
   goals met: 0 of 1
2. (op_2 obj_01 obj_16)
   deleted: (pred_9 obj_01)
   added: (pred_9 obj_16)
   goals met: 0 of 1
3. (op_5 obj_16 obj_14)
   deleted: (pred_12 obj_14 obj_16) (pred_8)
   added: (pred_2 obj_14)
   goals met: 0 of 1
4. (op_2 obj_16 obj_04)
   deleted: (pred_9 obj_16)
   added: (pred_9 obj_04)
   goals met: 0 of 1
5. (op_2 obj_04 obj_03)
   deleted: (pred_9 obj_04)
   added: (pred_9 obj_03)
   goals met: 0 of 1
6. (op_2 obj_03 obj_08)
   deleted: (pred_9 obj_03)
   added: (pred_9 obj_08)
   goals met: 0 of 1
7. (op_1 obj_08 obj_14)
   deleted: (pred_2 obj_14)
   added: (pred_8) (pred_12 obj_14 obj_08)
   goals met: 1 of 1
